Table of Contents
Namespace IdeaRS.OpenModel.Connection
 Classes
AnchorGrid
Data of the anchor grid
ApplyConnTemplateSetting
Defaults which are used for applying template
BeamData
Provides data of the connected beam
BeamLoadsImportMappingData
BeamLoadsImportMappingData
BendData
Provides data of bend
BoltGrid
Data of the bolt grid
BucklingRes
Results of the buckling analysis
CheckResAnchor
Check value for Anchor
CheckResBolt
Check value for Bolts
CheckResConcreteBlock
Check value for Concrete Block
CheckResPlate
Check value for Plate
CheckResSummary
Check summary
CheckResWeld
Check value for Weld
ConProjectInfo
Provides informationabout
ConcreteBlock
Data of concrete block
ConcreteBlockData
Provides data of the single concrete block
ConnectedMember
ConnectedMember
ConnectionCheckRes
Results for connection in project
ConnectionData
Provides data of the connection
ConnectionInfo
Provides information about connection
ConnectionLoadInfo
Information about connection load update
ConnectionPoint
ConnectedDesignMemeber
ConnectionResultsData
Results for all connections in project
CutBeamByBeamData
Provides data of the cut objec by object
CutData
Provides data of the cut beam
FoldedPlateData
Provides data of the folded plate
IdeaConImportSettings
Represents settings of improt options into Idea Connections
IdeaSMemberImportSettings
Represents settings of improt options into Idea Connections
OpenProjectResult
PlateData
Provides data of the single plate
ReportSettings
Report settings for IDEA connections.
WeldData
Provides data of the single weld
 Enums
CutMethod
Cut method
CutOrientation
Represents the type of the cut
CutPart
DistanceComparison
Represents the result of comparison of distances of two object from the same point
FormulasType
Type formulas output
ReportType
Defines a report type.
UnitType
Defines a unit type.
WeldType
enum of weld types